window.onload = 
function(){
    
  var bmitext = JSON.parse(localStorage.getItem("bmi"));
  if(bmitext) {
      document.getElementById("displaybmitext").textContent = bmitext;
      //console.log(displaytext);
  }

  var strokepercent = JSON.parse(localStorage.getItem("percentfullscore"));
  
  if(strokepercent) {
      document.getElementById("displaystroketext").textContent = strokepercent;
      //console.log(displaytext);
  }
    
}

var cholesterolshow = JSON.parse(localStorage.getItem("cholesteroltext"));
var HDLshow = JSON.parse(localStorage.getItem("HDLtext"));
var LDLshow = JSON.parse(localStorage.getItem("LDLtext"));
//console.log(cholesterolshow);
//console.log(HDLshow);
//console.log(LDLshow);   

/*function checkDiabetesRisk(lipidshow){
  if (bmitextshow < 18.5) {
    return "คุณอยู่ในเกณฑ์ผอมเกินไป";
  } else if (bmitextshow >= 18.5 && bmitextshow <= 24.9) {
    return "คุณอยู่ในเกณฑ์ปกติ";
  } else if (bmitextshow >= 25 && bmitextshow <= 29.9) {
    return "คุณอยู่ในเกณฑ์โรคอ้วน ";
  } else {
    return "คุณอยู่ในเกณฑ์โรคอ้วนอันตราย ";
  }
}*/


var bmitextshow = JSON.parse(localStorage.getItem("bmi"));

function checkbmirisk(bmitextshow){
  if (bmitextshow < 18.5) {
    return "คุณอยู่ในเกณฑ์ผอมเกินไป ";
  } else if (bmitextshow >= 18.5 && bmitextshow <= 24.9) {
    return "คุณอยู่ในเกณฑ์ปกติ";
  } else if (bmitextshow >= 25 && bmitextshow <= 29.9) {
    return  ;
  } else {
    return "คุณอยู่ในเกณฑ์โรคอ้วนอันตราย ";
  }
  
}
var bmirisk = checkbmirisk(bmitextshow); 

//------------------------------------------------------------------คนละอัน

var bmiwarningtext = JSON.parse(localStorage.getItem("bmi"));

function checkbmiwarning(bmiwarningtext){
  if (bmiwarningtext < 18.5) {
    return "1.หากทำทุกวิถีทางแล้วยังผอม มีน้ำหนักที่ต่ำกว่าเกณฑ์ ควรปรึกษาแพทย์ผู้ชำนาญการเพื่อหาสาเหตุและแก้ไขปัญหาอย่างเหมาะสม เช่น ไม่เบื่ออาหารแต่กลัวอ้วน จึงล้วงคอเพื่อให้อาเจียน เรียกโรคนี้ว่าบูลิเมีย เนอร์โวซา (bulimia nervosa) มีปัญหาทางช่องปากและฟัน มีปัญหาระบบทางเดินอาหาร ทำให้การย่อยการดูดซึมผิดปกติ  ‍  ‍ ‍  ‍ ‍  ‍ ‍  ‍  ‍ ‍  ‍ ‍  ‍ ‍  ‍  ‍ ‍  ‍ ‍  ‍ ‍  ‍  ‍ ‍  ‍ ‍  ‍ ‍  ‍  ‍ ‍  ‍ ‍  ‍ ‍  ‍  ‍ ‍  ‍ ‍  ‍ ‍  ‍  ‍ ‍  ‍ ‍  ‍ ‍  ‍  ‍ ‍  ‍ ‍  ‍ ‍  ‍  ‍ ‍  ‍ ‍  ‍ ‍  ‍  ‍ ‍  ‍ ‍  ‍ ‍  ‍  ‍ ‍  ‍ ‍  ‍ ‍  ‍  ‍ ‍  ‍ ‍  ‍ ‍  ‍  ‍ ‍  ‍ ‍  ‍  ‍ ‍  ‍ ‍  ‍ ‍  ‍  ‍ ‍ ‍  ‍ ‍  ‍ ‍  ‍ ‍  ‍ ‍  ‍ ‍  ‍  ‍ ‍   ‍ ‍  ‍ ‍  ‍  ‍ ‍  ‍ ‍  ‍ ‍  ‍  ‍ ‍  ‍ ‍  ‍ ‍  ‍  ‍ ‍  ‍ ‍  ‍ ‍  ‍  ‍ ‍  ‍ ‍  ‍ ‍  ‍  ‍ ‍  ‍ ‍  ‍ ‍  ‍  ‍ ‍  ‍ ‍  ‍ ‍  ‍  ‍ ‍  ‍ ‍  ‍ ‍  ‍   ‍ ‍  ‍ ‍  ‍ 2.ดื่มน้ำเปล่าสะอาดอย่างน้อย 8 – 10 แก้วต่อวัน เพราะน้ำจะช่วยขับสารพิษ รักษาสมดุล และอุณหภูมิที่เหมาะสมของร่างกาย  ‍  ‍  ‍ ‍  ‍ ‍  ‍ ‍  ‍  ‍ ‍  ‍ ‍  ‍ ‍  ‍  ‍ ‍  ‍ ‍  ‍ ‍  ‍  ‍ ‍  ‍ ‍  ‍ ‍  ‍  ‍  ‍  ‍ ‍  ‍ ‍  ‍ ‍  ‍  ‍ ‍  ‍ ‍  ‍ ‍  ‍  ‍ ‍  ‍ ‍  ‍ ‍  ‍  ‍ ‍  ‍ ‍  ‍ ‍  ‍  ‍  ‍  ‍ ‍  ‍ ‍  ‍ ‍  ‍  ‍ ‍  ‍ ‍  ‍ ‍  ‍  ‍ ‍  ‍ ‍  ‍ ‍  ‍  ‍ ‍  ‍ ‍  ‍ ‍  ‍  ‍  ‍  ‍  ‍ ‍  ‍ ‍  ‍ ‍  ‍  ‍ ‍  ‍ ‍  ‍ ‍  ‍  ‍ ‍  ‍ ‍  ‍ ‍  ‍  ‍ ‍  ‍ ‍  ‍ ‍  ‍  ‍  ‍ ‍  ‍ ‍  ‍ ‍  ‍  ‍ ‍  ‍ ‍  ‍ ‍  ‍  ‍ ‍  ‍ ‍  ‍ ‍  ‍  ‍ ‍  ‍ ‍  ‍ ‍  ‍  3.เลือกวิธีปรุงอาหารแบบ ต้ม นึ่ง ย่างมากกว่าการทอดหรือผัด  ‍  ‍  ‍ ‍  ‍ ‍  ‍ ‍  ‍  ‍ ‍  ‍ ‍  ‍ ‍  ‍  ‍ ‍  ‍ ‍  ‍ ‍  ‍  ‍ ‍  ‍ ‍  ‍ ‍  ‍  ‍  ‍  ‍ ‍  ‍ ‍  ‍ ‍  ‍  ‍ ‍  ‍ ‍  ‍  ‍ ‍  ‍ ‍  ‍ ‍  ‍ ‍  ‍  ‍ ‍   ‍ ‍  ‍ ‍  ‍ ‍  ‍ ‍ ‍  ‍ ‍  ‍  ‍ ‍  ‍ ‍  ‍ ‍  ‍ 4.ลด ละ เลิก เครื่องดื่มที่มีปริมาณน้ำตาลหรือแอลกอฮอล์สูง เช่น น้ำอัดลม (1 กระป๋องมีน้ำตาล 7 – 12 ช้อนชา) และเครื่องดื่มชาเขียว (1 ขวดมีน้ำตาล 8 – 14 ช้อนชา) ‍ ‍  ‍  ‍ ‍  ‍ ‍  ‍ ‍  ‍  ‍  ‍  ‍ ‍  ‍ ‍  ‍ ‍  ‍  ‍ ‍  ‍ ‍  ‍  ‍ ‍  ‍ ‍  ‍ ‍  ‍ ‍  ‍  ‍ ‍ ‍ ‍  ‍  ‍ ‍  ‍ ‍  ‍ ‍  ‍  ‍  ‍  ‍ ‍  ‍ ‍  ‍ ‍  ‍  ‍ ‍  ‍ ‍  ‍  ‍ ‍  ‍ ‍  ‍ ‍  ‍ ‍  ‍  ‍ ‍ ‍ ‍  ‍  ‍ ‍  ‍ ‍ ‍ ‍  ‍  ‍ ‍  ‍ ‍  ‍ ‍ ‍ ‍ ‍  ‍ ‍  ‍  ‍  ‍ ‍ 5.ออกกำลังกายอย่างน้อยวันละ 30 นาที ตามความเหมาะสมของสภาพร่างกาย อย่าลืมคำนึงถึงความปลอดภัยและไม่ควรหักโหมจนเกินไป สำหรับผู้มีน้ำหนักมากเลี่ยงกีฬาหรือการออกกำลังที่ทำให้เกิดการกระแทกของข้อเท้า ซึ่งอาจทำให้บาดเจ็บได้ เปลี่ยนเป็นการเดินช้า ๆ โยคะ หรือว่ายน้ำ   ‍  ‍ ‍  ‍ ‍  ‍ ‍  ‍  ‍ ‍  ‍ ‍  ‍ ‍  ‍  ‍ ‍  ‍ ‍  ‍ ‍   ‍  ‍ ‍ ‍ ‍  ‍  ‍ ‍  ‍ ‍  ‍ ‍  ‍  ‍  ‍ ‍  ‍6.นอนหลับพักผ่อนในช่วงเวลาที่เหมาะสมคือ 22.00 – 06.00 น. โดยหลับสนิทติดต่อกันนาน เพราะการนอนหลับ ๆ ตื่น ๆ จะทำให้ระบบเผาผลาญของร่างกายเสียสมดุล   ‍  ‍ ‍  ‍ ‍  ‍ ‍  ‍  ‍ ‍  ‍ ‍  ‍ ‍  ‍   ‍  ‍ ‍  ‍ ‍  ‍ ‍  ‍  ‍ ‍  ‍ ‍  ‍ ‍  ‍  ‍ ‍  ‍ ‍  ‍ ‍  ‍  ‍ ‍  ‍ ‍  ‍ ‍  ‍  ‍  ‍ ‍  ‍ ‍  ‍ ‍  ‍  ‍ ‍  ‍ ‍  ‍ ‍  ‍ ‍  ‍  ‍ ‍  ‍ ‍  ‍ ‍  ‍ ‍ ‍  ‍ ‍  ‍ ‍  ‍  ‍ ‍  ‍ ‍  ‍ ‍  ‍7.เคลื่อนไหวร่างกายให้มากขึ้นในแต่ละวัน เริ่มง่าย ๆ ด้วยการแกว่งแขน ทำท่ากายบริหารง่าย ๆ เดินเล่นในสวน ขึ้นลงบันไดแทนการใช้ลิฟต์ จัดตารางการออกกำลังกายส่วนตัวที่ต้องทำสม่ำเสมอ  ‍  ‍ ‍  ‍ ‍  ‍ ‍  ‍  ‍ ‍  ‍ ‍  ‍ ‍  ‍  ‍ ‍  ‍ ‍  ‍ ‍  ‍  ‍ ‍  ‍ ‍  ‍ ‍  ‍  ‍  ‍ ‍  ‍ ‍  ‍ ‍  ‍   ‍  ‍ ‍  ‍ ‍  ‍ ‍  ‍ 8.หากทำทุกวิถีทางแล้วยังไม่สามารถลดความอ้วนได้ ปรึกษาแพทย์ผู้ชำนาญการเพื่อหาสาเหตุและแก้ไขปัญหาอย่างเหมาะสม เช่น การผ่าตัดกระเพาะในรูปแบบต่าง ๆ ที่นอกจากรักษาโรคอ้วนแล้วยังช่วยลดความเสี่ยงการเกิดโรคแทรกซ้อนอื่น ๆ ด้วย ";
  } else if (bmiwarningtext >= 18.5 && bmiwarningtext<= 24.9) {
    return "คุณควรคำนวณพลังงานที่ควรได้รับต่อวันเพื่อไม่ให้น้ำหนักเกิน โดยการคำนวณปริมาณพลังงานที่ควรได้รับต่อวันBMR ย่อมาจาก Basal Metabolic Rate หรือเราสามารถเรียกได้ว่าเป็นพลังงานขั้นพื้นฐาน โดยค่าพลังงานนี้ร่างกายจะใช้ในการขับเคลื่อนระบบเเละควบคุมอวัยวะต่างๆ ในร่างกายโดยใช้ เพศ,น้ำหนัก,ส่วนสูง และอายุ ในการคำนวนดังนั้น ค่าBMRในแต่ละคนจึงมีค่าไม่เท่ากันTDEE คือ Total Daily Energy Expenditure หรือ ค่าของพลังงานที่ใช้ทั้งหมดในแต่ละวัน หาได้จากพลังงานที่ใช้ทั้งหมดในแต่ละวัน = พลังงานขั้นพื้นฐาน(BMR) x กิจกรรมในการออกกำลังกายกิจกรรมในการออกกำลังกายนั่งอยู่กับที่ หรือ ออกกำลังกายน้อย = 1.2ออกกำลังกาย 1-3 ต่อสัปดาห์ = 1.375ออกกำลังกาย 3-5 ต่อสัปดาห์ = 1.54ออกกำลังกาย 6-7 ต่อสัปดาห์ = 1.725ออกกำลังกาย 2 ครั้งต่อวัน = 1.9ถ้าจะต้องการจะควบคุมน้ำหนักจะต้องได้รับพลังงานในแต่ละวันในปริมาณที่ไม่มากกว่าที่ใช้ คือ พลังงานขั้นพื้นฐาน ถึง พลังงานที่ใช้ทั้งหมดในแต่ละวัน                        ตัวอย่างพลังงานที่ใช้ทั้งหมดในแต่ละวัน = พลังงานขั้นพื้นฐาน(BMR) x กิจกรรมในการออกกำลังกายพลังงานที่ใช้ทั้งหมดในแต่ละวัน = 1300 x 1.375 = 1787.5 คือ พลังงานที่ต้องการในแต่วันเท่ากับ 1300 แต่ไม่เกิน 1800 กิโลแคลอรี่โดยประมาณ";
  } else if (bmiwarningtext >= 25 && bmiwarningtext <= 29.9) {
    return "1.ไม่แนะนำให้กินอาหารหวานจัด มันจัด เค็มจัด หรืออาหารที่มีไขมันสูง เพื่อให้ได้แคลอรี่มาก เพราะจะทำให้เสี่ยงเป็นโรคเบาหวาน ความดันโลหิตสูง และไขมันในเลือดสูงได้ หรือมีพุงแทนที่จะมีกล้ามเนื้อ  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍ ‍  ‍  ‍   ‍ ‍  ‍  ‍ ‍  ‍  ‍   ‍ ‍ 2.ทานอาหารจำพวกโปรตีน เสริมสร้างกล้ามเนื้อ เช่นนม ไข่ ถั่ว ธัญพืช เพิ่มการรับประทานคาร์โบไฮเดรตที่มีประโยชน์ เช่น ข้าวกล้อง ข้าวไรเบอรี่ การเพิ่มน้ำหนักควรเพิ่มพลังงานจากเดิม วันละ 500กิโลแคลอรี่ต่อวัน โดยอาจจะเพิ่มมื้ออาหาร อย่าลืมว่าอาหารที่เพิ่มควรจะเป็นโปรตีน หรือข้าว แป้ง ธัญพืชขัดสีน้อยแทน ขนมหวานหรืออาหารมันๆ ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍ ‍  ‍  ‍   ‍ ‍  ‍  ‍  ‍  ‍ ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍ ‍  ‍  ‍   ‍ ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍ ‍  ‍  ‍   ‍ ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍ ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍ ‍  ‍  ‍   ‍ ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍ ‍  ‍  ‍   ‍ ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍ ‍  ‍  ‍   ‍ ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍ ‍  ‍  ‍   ‍ ‍   ‍ ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍ ‍  ‍  ‍   ‍ ‍   ‍  ‍  ‍  ‍  ‍ ‍  ‍  ‍   ‍ ‍  3.ดื่มน้ำเปล่าสะอาดอย่างน้อย 8 – 10 แก้วต่อวัน เพราะน้ำจะช่วยขับสารพิษ รักษาสมดุล และอุณหภูมิที่เหมาะสมของร่างกาย ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍ ‍  ‍  ‍   ‍ ‍  ‍  ‍ ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍ ‍  ‍  ‍   ‍ ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍ ‍  ‍  ‍   ‍ ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍ ‍  ‍  ‍   ‍ ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍ ‍  ‍  ‍  ‍  ‍ ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍ ‍  ‍  ‍   ‍ ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍ ‍  ‍  ‍   ‍ ‍  ‍  ‍ ‍  ‍  ‍   ‍ ‍   ‍  ‍  ‍  ‍  ‍ ‍  ‍  ‍   ‍ ‍  ‍  ‍   ‍ ‍   ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍ ‍  ‍  ‍   ‍ ‍  ‍ ‍  ‍  ‍   ‍ ‍  4.ออกกำลังกายอย่างน้อยวันละ 30 นาที ตามความเหมาะสมของสภาพร่างกาย อย่าลืมคำนึงถึงความปลอดภัยและไม่ควรหักโหมจนเกินไป การออกกำลังกายจะทำให้เพิ่มกล้ามเนื้อที่พอเหมาะ ทำให้อยากอาหารมากขึ้น เน้นโปรตีนและข้าวแป้ง ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍ ‍  ‍  ‍   ‍ ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍ ‍  ‍  ‍   ‍ ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍ ‍  ‍  ‍   ‍ ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍ ‍  ‍  ‍   ‍ ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍ ‍  ‍  ‍   ‍ ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍ ‍  ‍  ‍   ‍ ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍ ‍  ‍  ‍   ‍ ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍ ‍  ‍ ‍  ‍  ‍  ‍  ‍  ‍ ‍ ‍  ‍  ‍   ‍ ‍  ‍  ‍  ‍  ‍ ‍  ‍  ‍   ‍ ‍  5.พักผ่อนให้เพียงพอ อย่างน้อยวันละ 8 ชั่วโมง นอนหลับพักผ่อนในช่วงเวลาที่เหมาะสมคือ 22.00 – 06.00 น. โดยหลับสนิทติดต่อกันนาน  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍ ‍  ‍  ‍   ‍ ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍ ‍  ‍  ‍   ‍ ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍ ‍  ‍  ‍   ‍ ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍ ‍  ‍  ‍   ‍ ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍ ‍  ‍  ‍   ‍ ‍  ‍  ‍  ‍ ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍ ‍  ‍  ‍   ‍ ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍ ‍  ‍  ‍   ‍ ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍ ‍  ‍   ‍  ‍  ‍  ‍  ‍ ‍  ‍  ‍   ‍ ‍   ‍  ‍  ‍  ‍  ‍  ‍ ‍  ‍  ‍   ‍ ‍  6.แบ่งมื้ออาหารออกเป็นวันละ 5-6 มื้อ ไม่ควรดื่มน้ำก่อนรับประทานอาหาร   ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍ ‍  ‍  ‍   ‍ ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍ ‍  ‍  ‍   ‍ ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍ ‍  ‍  ‍   ‍ ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍ ‍  ‍  ‍   ‍ ‍ 7.ลดการกินเครื่องดื่มที่มีสารคาเฟอีน หรือเครื่องดื่มชูกำลัง เพราะจะทำให้อยากอาหารลดลง  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍ ‍  ‍  ‍   ‍ ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍ ‍  ‍  ‍   ‍ ‍ 8.งดการสูบบุหรี่ คนที่สูบบุรีมีแนวโน้มทำให้อยากอาหารลดลงมากกว่าคนที่ไม่สูบบุหรี่ ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍ ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍ ‍  ‍  ‍   ‍ ‍  ‍  ‍ ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍ ‍  ‍  ‍   ‍ ‍   ‍   ‍ ‍  9..หากทำทุกวิถีทางแล้วยังผอม มีน้ำหนักที่ต่ำกว่าเกณฑ์ ควรปรึกษาแพทย์ผู้ชำนาญการเพื่อหาสาเหตุและแก้ไขปัญหาอย่างเหมาะสม เช่น ไม่เบื่ออาหารแต่กลัวอ้วน จึงล้วงคอเพื่อให้อาเจียน เรียกโรคนี้ว่าบูลิเมีย เนอร์โวซา (bulimia nervosa) มีปัญหาทางช่องปากและฟัน มีปัญหาระบบทางเดินอาหาร ทำให้การย่อยการดูดซึมผิดปกติ";
  } else {
    return "1.ไม่แนะนำให้กินอาหารหวานจัด มันจัด เค็มจัด หรืออาหารที่มีไขมันสูง เพื่อให้ได้แคลอรี่มาก เพราะจะทำให้เสี่ยงเป็นโรคเบาหวาน ความดันโลหิตสูง และไขมันในเลือดสูงได้ หรือมีพุงแทนที่จะมีกล้ามเนื้อ  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍ ‍  ‍  ‍   ‍ ‍  ‍  ‍ ‍  ‍  ‍   ‍ ‍ 2.ทานอาหารจำพวกโปรตีน เสริมสร้างกล้ามเนื้อ เช่นนม ไข่ ถั่ว ธัญพืช เพิ่มการรับประทานคาร์โบไฮเดรตที่มีประโยชน์ เช่น ข้าวกล้อง ข้าวไรเบอรี่ การเพิ่มน้ำหนักควรเพิ่มพลังงานจากเดิม วันละ 500กิโลแคลอรี่ต่อวัน โดยอาจจะเพิ่มมื้ออาหาร อย่าลืมว่าอาหารที่เพิ่มควรจะเป็นโปรตีน หรือข้าว แป้ง ธัญพืชขัดสีน้อยแทน ขนมหวานหรืออาหารมันๆ ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍ ‍  ‍  ‍   ‍ ‍  ‍  ‍  ‍  ‍ ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍ ‍  ‍  ‍   ‍ ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍ ‍  ‍  ‍   ‍ ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍ ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍ ‍  ‍  ‍   ‍ ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍ ‍  ‍  ‍   ‍ ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍ ‍  ‍  ‍   ‍ ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍ ‍  ‍  ‍   ‍ ‍   ‍ ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍ ‍  ‍  ‍   ‍ ‍   ‍  ‍  ‍  ‍  ‍ ‍  ‍  ‍   ‍ ‍  3.ดื่มน้ำเปล่าสะอาดอย่างน้อย 8 – 10 แก้วต่อวัน เพราะน้ำจะช่วยขับสารพิษ รักษาสมดุล และอุณหภูมิที่เหมาะสมของร่างกาย ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍ ‍  ‍  ‍   ‍ ‍  ‍  ‍ ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍ ‍  ‍  ‍   ‍ ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍ ‍  ‍  ‍   ‍ ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍ ‍  ‍  ‍   ‍ ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍ ‍  ‍  ‍  ‍  ‍ ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍ ‍  ‍  ‍   ‍ ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍ ‍  ‍  ‍   ‍ ‍  ‍  ‍ ‍  ‍  ‍   ‍ ‍   ‍  ‍  ‍  ‍  ‍ ‍  ‍  ‍   ‍ ‍  ‍  ‍   ‍ ‍   ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍ ‍  ‍  ‍   ‍ ‍  ‍ ‍  ‍  ‍   ‍ ‍  4.ออกกำลังกายอย่างน้อยวันละ 30 นาที ตามความเหมาะสมของสภาพร่างกาย อย่าลืมคำนึงถึงความปลอดภัยและไม่ควรหักโหมจนเกินไป การออกกำลังกายจะทำให้เพิ่มกล้ามเนื้อที่พอเหมาะ ทำให้อยากอาหารมากขึ้น เน้นโปรตีนและข้าวแป้ง ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍ ‍  ‍  ‍   ‍ ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍ ‍  ‍  ‍   ‍ ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍ ‍  ‍  ‍   ‍ ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍ ‍  ‍  ‍   ‍ ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍ ‍  ‍  ‍   ‍ ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍ ‍  ‍  ‍   ‍ ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍ ‍  ‍  ‍   ‍ ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍ ‍  ‍ ‍  ‍  ‍  ‍  ‍  ‍ ‍ ‍  ‍  ‍   ‍ ‍  ‍  ‍  ‍  ‍ ‍  ‍  ‍   ‍ ‍  5.พักผ่อนให้เพียงพอ อย่างน้อยวันละ 8 ชั่วโมง นอนหลับพักผ่อนในช่วงเวลาที่เหมาะสมคือ 22.00 – 06.00 น. โดยหลับสนิทติดต่อกันนาน  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍ ‍  ‍  ‍   ‍ ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍ ‍  ‍  ‍   ‍ ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍ ‍  ‍  ‍   ‍ ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍ ‍  ‍  ‍   ‍ ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍ ‍  ‍  ‍   ‍ ‍  ‍  ‍  ‍ ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍ ‍  ‍  ‍   ‍ ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍ ‍  ‍  ‍   ‍ ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍ ‍  ‍   ‍  ‍  ‍  ‍  ‍ ‍  ‍  ‍   ‍ ‍   ‍  ‍  ‍  ‍  ‍  ‍ ‍  ‍  ‍   ‍ ‍  6.แบ่งมื้ออาหารออกเป็นวันละ 5-6 มื้อ ไม่ควรดื่มน้ำก่อนรับประทานอาหาร   ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍ ‍  ‍  ‍   ‍ ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍ ‍  ‍  ‍   ‍ ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍ ‍  ‍  ‍   ‍ ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍ ‍  ‍  ‍   ‍ ‍ 7.ลดการกินเครื่องดื่มที่มีสารคาเฟอีน หรือเครื่องดื่มชูกำลัง เพราะจะทำให้อยากอาหารลดลง  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍ ‍  ‍  ‍   ‍ ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍ ‍  ‍  ‍   ‍ ‍ 8.งดการสูบบุหรี่ คนที่สูบบุรีมีแนวโน้มทำให้อยากอาหารลดลงมากกว่าคนที่ไม่สูบบุหรี่ ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍ ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍ ‍  ‍  ‍   ‍ ‍  ‍  ‍ ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍ ‍  ‍  ‍   ‍ ‍   ‍   ‍ ‍  9..หากทำทุกวิถีทางแล้วยังผอม มีน้ำหนักที่ต่ำกว่าเกณฑ์ ควรปรึกษาแพทย์ผู้ชำนาญการเพื่อหาสาเหตุและแก้ไขปัญหาอย่างเหมาะสม เช่น ไม่เบื่ออาหารแต่กลัวอ้วน จึงล้วงคอเพื่อให้อาเจียน เรียกโรคนี้ว่าบูลิเมีย เนอร์โวซา (bulimia nervosa) มีปัญหาทางช่องปากและฟัน มีปัญหาระบบทางเดินอาหาร ทำให้การย่อยการดูดซึมผิดปกติ";
  }
  
}
var bmiwarning = checkbmiwarning(bmiwarningtext); 
//------------------------------------------------------------------
var sugarnum = JSON.parse(localStorage.getItem("sugartext"));

function checkDiabetesRisk(sugarnum){
  if (sugarnum <= 100) {
    return "คุณไม่มีความเสี่ยงในการเป็นโรคเบาหวาน";
  } else if (sugarnum >= 100 && sugarnum <= 125) {
    return "คุณมีความเสี่ยงเป็นโรคเบาหวาน";
  } else {
    return "คุณเป็นโรคเบาหวาน ";
  }

}

var diabetesRisk = checkDiabetesRisk(sugarnum); 
//------------------------------------------------------------------คนละอัน
var sugarnumwarningtext = JSON.parse(localStorage.getItem("sugartext"));

function checkDiabeteswarning(sugarnumwarningtext){
  if (sugarnumwarningtext <= 100) {
    return "1.หมั่นเช็กตรวจสุขภาพเป็นประจำปีทุกปี เพื่อเช็กระดับน้ำตาลและความแข็งแรงของร่างกายด้านอื่นๆ เพื่อรับมือกับอาการหรือโรคที่อาจจะเกิดขึ้น  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍ ‍  ‍  ‍   ‍ ‍   ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  2.คัดกรองอย่างละเอียดหากมีความเสี่ยงเข้าอายุเกิน 35 ปี คนในครอบครัวเป็นเบาหวาน มีวิถีชีวิตที่เสี่ยงทำให้เกิดโรคเบาหวาน ควรตรวจคัดกรองอย่างละเอียด เพื่อการดูแลตัวเองที่เหมาะสม  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍ ‍  ‍  ‍   ‍ ‍  ‍  ‍  ‍  ‍  ‍  ‍ ‍  ‍  ‍   ‍ ‍  ‍  ‍  ‍ ‍  ‍  ‍   ‍ ‍ 3.เลือกอาหารมีกากใยเน้นกินผักและผลไม้ที่มีกากใยสูง เช่น ธัญพืช ข้าวกล้อง ขนมปังโฮลวีต เป็นต้น เพราะมีน้ำตาลน้อย ย่อยง่าย เพื่อสุขภาพที่ดี  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍ ‍  ‍  ‍   ‍ ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍ ‍  ‍  ‍   ‍ ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍ ‍  ‍  ‍   ‍ ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍ ‍  ‍  ‍   ‍   ‍  ‍  ‍  ‍  ‍  ‍ ‍  ‍  ‍ ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍ ‍  ‍  ‍   ‍ ‍    ‍ ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍ ‍  ‍  ‍   ‍ ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍ ‍  ‍  ‍   ‍ ‍  ‍  ‍ ‍  ‍  ‍   ‍ ‍ 4.กินอาหารตามมื้อไม่กินจุบจิบ กินให้จบเป็นมื้อ เพื่อรักษาสมดุลของระดับน้ำตาลและให้การทำงานของฮอร์โมนอินซูลินทำงานอย่างเป็นระบบ  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍ ‍  ‍  ‍   ‍ ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍ ‍  ‍  ‍   ‍ ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍ ‍  ‍  ‍   ‍ ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍ ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍ ‍  ‍  ‍   ‍ ‍  ‍  ‍  ‍  ‍  ‍ ‍  ‍  ‍   ‍ ‍  ‍  ‍  ‍  ‍ ‍  ‍  ‍   ‍ ‍   ‍ ‍  ‍  ‍   ‍ ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍ ‍  ‍  ‍   ‍ ‍  5.กินดีเลือกกินอาหารที่มีประโยชน์ต่อสุขภาพ ลดอาหารประเภทแป้ง คาร์โบไฮเดรต น้ำตาล ยิ่งอายุมากขึ้นก็ยิ่งต้องลดลง  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍ ‍  ‍  ‍   ‍ ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍ ‍  ‍  ‍   ‍ ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍ ‍  ‍  ‍   ‍ ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍ ‍  ‍  ‍   ‍ ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍ ‍  ‍  ‍   ‍ ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍ ‍  ‍  ‍   ‍ ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍ ‍  ‍  ‍   ‍ ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍ ‍  ‍  ‍   ‍ ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍ ‍  ‍  ‍   ‍ ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍ ‍  ‍  ‍   ‍ ‍  ‍  ‍  ‍  ‍  ‍    ‍  ‍ ‍   ‍   ‍ ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍ ‍  ‍  ‍   ‍ ‍  6.งดเครียดนอนดึก  พักผ่อนน้อย โหมทำงานอย่างหนัก ปัจจัยเหล่านี้ทำให้ร่างกายหลั่งฮอร์โมนคอร์ติซอล ซึ่งเป็นฮอร์โมนที่กระตุ้นให้ร่างกายปล่อยน้ำตาลออกมา เมื่อเครียดบ่อยๆ ก็จะทำให้น้ำตาลในเลือดสูง ซึ่งเป็นสาเหตุของเบาหวาน นอกจากนี้สาเหตุเหล่านี้ก็ยังทำให้สุขภาพโดยรวมไม่ดี กระทบต่อระบบการทำงานของร่างกายทั้งหมด  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍ ‍  ‍  ‍   ‍ ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍ ‍  ‍  ‍   ‍ ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍ ‍  ‍  ‍   ‍ ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍ ‍  ‍  ‍   ‍ ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍ ‍  ‍  ‍   ‍ ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍ ‍  ‍  ‍   ‍ ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍ ‍  ‍  ‍   ‍ ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍ ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍ ‍  ‍  ‍   ‍ ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍ ‍  ‍  ‍   ‍ ‍  ‍  ‍  ‍  ‍  ‍  ‍  ‍‍  ‍ ‍  ‍   ‍ ‍  7.ขยับเท่ากับออกกำลังกายออกกำลังกายด้วยวิธีใดก็ได้ แกว่งแขน เดิน วิ่ง ว่ายน้ำ ปั่นจักรยาน วันละ 20-30 นาที สัปดาห์ละ 3 ครั้ง";
  } else if (sugarnumwarningtext >= 100 && sugarnumwarningtext <= 125) {
    return "1.ควบคุมน้ำหนักตัวให้ปกติ โดยรับประทานอาหารให้ครบ 5 หมู่ ลดอาหารและเครื่องดื่มที่มีน้ำตาลทุกชนิด   เนื้อสัตว์ติดมันและไขมันประเภทต่างๆ ลดอาหารที่มีกะทิ เพิ่มอาหารประเภทผักให้มากขึ้น   ‍  ‍ ‍  ‍ ‍  ‍ ‍  ‍  ‍ ‍   ‍  ‍ ‍  ‍  ‍ ‍  ‍ ‍  ‍ ‍  ‍ ‍ ‍  ‍ ‍  ‍   ‍ ‍ ‍  ‍ ‍  ‍ ‍  ‍  ‍ ‍  ‍ ‍  ‍ ‍  ‍ 2. ออกกำลังกายอย่างสม่ำเสมอ ครั้งละ 20-30 นาที อย่างน้อยสัปดาห์ละ 3 ครั้ง   ‍  ‍ ‍   ‍  ‍ ‍  ‍  ‍ ‍  ‍ ‍  ‍ ‍  ‍ ‍ ‍  ‍ ‍  ‍  ‍ ‍   ‍  ‍ ‍  ‍  ‍  ‍  ‍ ‍   ‍  ‍ ‍  ‍  ‍ ‍  ‍ ‍  ‍ ‍  ‍ ‍  ‍ ‍  ‍ ‍ ‍  ‍ ‍3. ดื่มน้ำสะอาดอย่างน้อยวันละ 6-8 แก้ว  ‍  ‍ ‍   ‍  ‍ ‍  ‍  ‍ ‍  ‍ ‍  ‍ ‍  ‍ ‍ ‍  ‍ ‍  ‍  ‍ ‍    ‍  ‍ ‍   ‍  ‍ ‍  ‍  ‍ ‍  ‍ ‍  ‍ ‍  ‍ ‍ ‍  ‍ ‍  ‍  ‍ ‍   ‍ ‍  ‍ ‍ ‍  ‍ ‍  ‍  ‍ ‍   ‍   ‍ ‍  ‍ ‍  ‍ ‍  ‍ ‍  ‍ ‍ ‍  ‍ ‍  ‍ ‍ ‍  ‍  ‍ ‍  ‍ ‍  ‍ ‍  ‍ ‍ ‍  ‍ ‍ ‍  ‍ ‍  ‍  ‍ ‍  ‍ ‍  ‍ ‍  ‍ ‍ ‍  ‍ ‍  ‍  ‍ ‍   ‍  ‍ ‍  ‍  ‍ ‍  ‍ ‍  ‍ ‍  ‍ ‍ ‍  4. พักผ่อนให้เพียงพอและหลีกเลี่ยงความเครียด  ‍ ‍ ‍  ‍ ‍  ‍  ‍ ‍   ‍ ‍  ‍ ‍ ‍  ‍ ‍  ‍  ‍ ‍   ‍   ‍ ‍  ‍ ‍  ‍ ‍  ‍ ‍  ‍ ‍ ‍  ‍ ‍  ‍ ‍ ‍ ‍ ‍  ‍ ‍  ‍  ‍ ‍   ‍ ‍  ‍ ‍ ‍  ‍ ‍  ‍  ‍ ‍   ‍   ‍ ‍  ‍ ‍  ‍ ‍  ‍ ‍  ‍ ‍ ‍  ‍ ‍  ‍ ‍ ‍ ‍ ‍  ‍ ‍  ‍  ‍ ‍   ‍ ‍  ‍ ‍ ‍  ‍ ‍  ‍  ‍ ‍   ‍   ‍ ‍  ‍ ‍  ‍ ‍  ‍ ‍  ‍ ‍ ‍  ‍ ‍  ‍ ‍5. พบแพทย์เพื่อตรวจร่างกายตามนัดและปฏิบัติตาคำแนะนำของแพทย์โดยรับประทานยาหรือฉีดอินซูลินตามแพทย์สั่งอย่าหยุดยาหรือเพิ่มยาเอง  ‍ ‍ ‍  ‍ ‍  ‍  ‍ ‍   ‍ ‍  ‍ ‍ ‍  ‍ ‍  ‍  ‍ ‍   ‍   ‍ ‍  ‍ ‍  ‍ ‍  ‍ ‍  ‍ ‍ ‍  ‍ ‍  ‍ ‍ ‍ ‍ ‍ ‍  ‍ ‍  ‍  ‍ ‍   ‍ ‍  ‍ ‍ ‍  ‍ ‍  ‍  ‍ ‍   ‍   ‍ ‍  ‍ ‍  ‍ ‍  ‍ ‍ ‍  ‍ ‍  ‍ ‍  ‍ ‍  ‍ ‍ ‍  ‍ ‍  ‍ ‍ ‍ ‍  ‍ ‍ ‍ ‍   ‍ ‍  ‍ ‍ ‍  ‍ ‍  ‍  ‍ ‍  ‍  ‍ ‍   ‍ ‍  ‍ ‍ ‍  ‍ ‍  ‍  ‍ ‍   ‍   ‍ ‍  ‍ ‍  ‍ ‍  ‍ ‍  ‍ ‍ ‍  ‍ ‍  ‍ ‍6.ดูแลรักษาความสะอาดของร่างกายโดยเฉพาะอย่างยิ่งเท้าและซอกนิ้วเท้าถ้ามีบาดแผลเกิดขึ้นกับส่วนใดของร่างกาย ควรปรึกษาแพทย์โดยเร็ว ‍ ‍  ‍ ‍  ‍ ‍  ‍ ‍ ‍  ‍ ‍  ‍ ‍ ‍ ‍  ‍ ‍ ‍ ‍   ‍ ‍  ‍ ‍ ‍  ‍ ‍  ‍  ‍ ‍  ‍  ‍ ‍   ‍ ‍  ‍ ‍ ‍ ‍ ‍  ‍ ‍  ‍ ‍  ‍ ‍ ‍  ‍ ‍  ‍ ‍ ‍ ‍  ‍ ‍ ‍ ‍   ‍ ‍  ‍ ‍ ‍  ‍ ‍  ‍  ‍ ‍  ‍  ‍ ‍   ‍ ‍  ‍ ‍ ‍ ‍  ‍ ‍ ‍  ‍ ‍  ‍ ‍ ‍ ‍  ‍ ‍ ‍ ‍   ‍ ‍   ‍ ‍  ‍ ‍  ‍ ‍  ‍ ‍ ‍  ‍ ‍  ‍ ‍ ‍ ‍  ‍ ‍ ‍ ‍   ‍ ‍   ‍ ‍  ‍ ‍ ‍ 7.เลิกบุหรี่ แอลกอฮอล์และสิ่งเสพติด";
  } else {
    return "1.ควบคุมน้ำหนักตัวให้ปกติ โดยรับประทานอาหารให้ครบ 5 หมู่ ลดอาหารและเครื่องดื่มที่มีน้ำตาลทุกชนิด   เนื้อสัตว์ติดมันและไขมันประเภทต่างๆ ลดอาหารที่มีกะทิ เพิ่มอาหารประเภทผักให้มากขึ้น   ‍  ‍ ‍  ‍ ‍  ‍ ‍  ‍  ‍ ‍   ‍  ‍ ‍  ‍  ‍ ‍  ‍ ‍  ‍ ‍  ‍ ‍ ‍  ‍ ‍  ‍   ‍ ‍ ‍  ‍ ‍  ‍ ‍  ‍  ‍ ‍  ‍ ‍  ‍ ‍  ‍ 2. ออกกำลังกายอย่างสม่ำเสมอ ครั้งละ 20-30 นาที อย่างน้อยสัปดาห์ละ 3 ครั้ง   ‍  ‍ ‍   ‍  ‍ ‍  ‍  ‍ ‍  ‍ ‍  ‍ ‍  ‍ ‍ ‍  ‍ ‍  ‍  ‍ ‍   ‍  ‍ ‍  ‍  ‍  ‍  ‍ ‍   ‍  ‍ ‍  ‍  ‍ ‍  ‍ ‍  ‍ ‍  ‍ ‍  ‍ ‍  ‍ ‍ ‍  ‍ ‍3. ดื่มน้ำสะอาดอย่างน้อยวันละ 6-8 แก้ว  ‍  ‍ ‍   ‍  ‍ ‍  ‍   ‍  ‍ ‍  ‍ ‍ ‍ ‍ ‍  ‍  ‍  ‍ ‍    ‍  ‍ ‍   ‍  ‍ ‍  ‍  ‍ ‍  ‍ ‍  ‍ ‍  ‍ ‍ ‍  ‍ ‍  ‍  ‍ ‍   ‍ ‍  ‍ ‍ ‍  ‍ ‍  ‍  ‍ ‍   ‍   ‍ ‍  ‍ ‍  ‍ ‍  ‍ ‍  ‍ ‍ ‍  ‍ ‍  ‍ ‍ ‍  ‍  ‍ ‍  ‍ ‍  ‍ ‍  ‍ ‍ ‍  ‍ ‍ ‍  ‍ ‍  ‍  ‍ ‍  ‍ ‍  ‍ ‍  ‍ ‍ ‍  ‍ ‍  ‍  ‍ ‍   ‍  ‍ ‍  ‍  ‍ ‍  ‍ ‍  ‍ ‍  ‍ ‍ ‍  ‍ ‍ 4. พักผ่อนให้เพียงพอและหลีกเลี่ยงความเครียด  ‍ ‍ ‍  ‍ ‍  ‍  ‍ ‍   ‍ ‍  ‍ ‍ ‍  ‍ ‍  ‍  ‍ ‍   ‍   ‍ ‍  ‍ ‍  ‍ ‍  ‍ ‍  ‍ ‍ ‍  ‍ ‍  ‍ ‍ ‍ ‍ ‍  ‍ ‍  ‍  ‍ ‍   ‍ ‍  ‍ ‍ ‍  ‍ ‍  ‍  ‍ ‍   ‍   ‍ ‍  ‍ ‍  ‍ ‍  ‍ ‍  ‍ ‍ ‍  ‍ ‍  ‍ ‍ ‍ ‍ ‍  ‍ ‍  ‍  ‍ ‍   ‍ ‍  ‍ ‍ ‍  ‍ ‍  ‍  ‍ ‍   ‍   ‍ ‍  ‍ ‍  ‍ ‍  ‍ ‍  ‍ ‍ ‍  ‍ ‍  ‍ ‍5. พบแพทย์เพื่อตรวจร่างกายตามนัดและปฏิบัติตาคำแนะนำของแพทย์โดยรับประทานยาหรือฉีดอินซูลินตามแพทย์สั่งอย่าหยุดยาหรือเพิ่มยาเอง  ‍ ‍ ‍  ‍ ‍  ‍  ‍ ‍   ‍ ‍  ‍ ‍ ‍  ‍ ‍  ‍  ‍ ‍   ‍   ‍ ‍  ‍ ‍  ‍ ‍  ‍ ‍  ‍ ‍ ‍  ‍ ‍  ‍ ‍ ‍ ‍ ‍ ‍  ‍ ‍  ‍  ‍ ‍   ‍ ‍  ‍ ‍ ‍  ‍ ‍  ‍  ‍ ‍   ‍   ‍ ‍  ‍ ‍  ‍ ‍  ‍ ‍ ‍  ‍ ‍  ‍ ‍  ‍ ‍  ‍ ‍ ‍  ‍ ‍  ‍ ‍ ‍ ‍  ‍ ‍ ‍ ‍   ‍ ‍  ‍ ‍ ‍  ‍ ‍  ‍  ‍ ‍  ‍  ‍ ‍   ‍ ‍  ‍ ‍ ‍  ‍ ‍  ‍  ‍ ‍   ‍   ‍ ‍  ‍ ‍  ‍ ‍  ‍ ‍  ‍ ‍ ‍  ‍ ‍  ‍ ‍6.ดูแลรักษาความสะอาดของร่างกายโดยเฉพาะอย่างยิ่งเท้าและซอกนิ้วเท้าถ้ามีบาดแผลเกิดขึ้นกับส่วนใดของร่างกาย ควรปรึกษาแพทย์โดยเร็ว ‍ ‍  ‍ ‍  ‍ ‍  ‍ ‍ ‍  ‍ ‍  ‍ ‍ ‍ ‍  ‍ ‍ ‍ ‍   ‍ ‍  ‍ ‍ ‍  ‍ ‍  ‍  ‍ ‍  ‍  ‍ ‍   ‍ ‍  ‍ ‍ ‍ ‍ ‍  ‍ ‍  ‍ ‍  ‍ ‍ ‍  ‍ ‍  ‍ ‍ ‍ ‍  ‍ ‍ ‍ ‍   ‍ ‍  ‍ ‍ ‍  ‍ ‍  ‍  ‍ ‍  ‍  ‍ ‍   ‍ ‍  ‍ ‍ ‍ ‍  ‍ ‍ ‍  ‍ ‍  ‍ ‍ ‍ ‍  ‍ ‍ ‍ ‍   ‍ ‍   ‍ ‍  ‍ ‍  ‍ ‍  ‍ ‍ ‍  ‍ ‍  ‍ ‍ ‍ ‍  ‍ ‍ ‍ ‍   ‍ ‍   ‍ ‍  ‍ ‍ ‍ 7.เลิกบุหรี่ แอลกอฮอล์และสิ่งเสพติด";
  }

}

var diabeteswarning = checkDiabeteswarning(sugarnumwarningtext); 
//----------------------------------------------------------
var fullscoreshow = JSON.parse(localStorage.getItem("fullscoretext"));

function checkstrokerisk(fullscoreshow){
  if (fullscoreshow < 0.1) {
    return "จัดอยู่ในกลุ่มเสี่ยงต่ำ";
  } else if (fullscoreshow >= 0.1 && fullscoreshow < 0.2) {
    return "จัดอยู่ในกลุ่มเสี่ยงปานกลาง";
  } else if (fullscoreshow >= 0.2 && fullscoreshow < 0.3) {
    return "จัดอยู่ในกลุ่มเสี่ยงสูง";
  } else if (fullscoreshow >= 0.3 ) {
    return "จัดอยู่ในกลุ่มเสี่ยงสูงมาก";
  }
    
  

}
var strokerisk = checkstrokerisk(fullscoreshow); 
//------------------------------------------------------------------คนละอัน
var fullscorewarning = JSON.parse(localStorage.getItem("fullscoretext"));

function checkstrokewarning(fullscorewarning){
  if (fullscorewarning < 0.1) {
    return "เพื่อป้องกันการเกิดโรคหลอดเลือดในอนาคต ควรออกกำลังกายอย่างสม่ำเสมอ รับประทานผักผลไม้เป็นประจำ ควบคุมระดับความดันโลหิตให้ดี ควบคุมน้ำหนักให้อยู่ในเกณฑ์ปกติและตรวจสุขภาพประจำปี";
  } else if (fullscorewarning >= 0.1 && fullscorewarning < 0.2) {
    return "ควรออกกำลังกายอย่างสม่ำเสมอ รับประทานผักผลไม้เป็นประจำ เลิกสูบบุหรี่ รักษาระดับน้ำตาลในเลือดให้อยู่ในเกณฑ์ปกติ ควบคุมระดับความดันโลหิตให้ดี หลีกเลี่ยงการรับประทานอาหารที่มีคลอเรสเตอรอลและไขมันอิ่มตัวสูง ควบคุมอาการของโรคเบาหวาน ควบคุมน้ำหนักให้อยู่ในเกณฑ์ปกติ และควรได้รับการตรวจร่างกายประจำปีอย่างสม่ำเสมอหรืออาจจะเข้าพบแพทย์เพื่อความสบายจส่วนบุคคล";
  } else if (fullscorewarning >= 0.2 && fullscorewarning < 0.3) {
    return "ควรเข้ารับคำปรึกษาจากแพทย์โดยด่วน ในเบื้องต้นควรออกกำลังกายอย่างสม่ำเสมอ รับประทานผักผลไม้เป็นประจำ เลิกสูบบุหรี่ หลีกเลี่ยงการรับประทานอาหารที่มีคลอเรสเตอรอลและไขมันอิ่มตัวสูง รักษาระดับน้ำตาลในเลือดให้อยู่ในเกณฑ์ปกติ ควบคุมระดับความดันโลหิตให้ดี ควบคุมน้ำหนักให้อยู่ในเกณฑ์ปกติและเข้ารับการตรวจสุขภาพประจำปีอย่างสม่ำเสมอ";
  } else if (fullscorewarning >= 0.3 ) {
    return "พบแพทย์โดยด่วน ควรโทรเรียกรถพยาบาล 1669 โดยทันที ";
  } 

}
var strokewarning = checkstrokewarning(fullscorewarning); 
//-----------------------------------------------------------

console.log(diabetesRisk);
console.log(sugarnum);
console.log(fullscoreshow);
 







